
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 12 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * azurerm_api_management_subscription.fee_pay_team_fee_register_subscription
  * azurerm_api_management_subscription.liberata_supplier_fee_register_subscription
  * azurerm_key_vault_secret.fee_pay_team_fee_register_subscription_key
  * azurerm_key_vault_secret.liberata_supplier_fee_register_subscription_key
  * module.cft_api_mgmt_api.azurerm_api_management_api.api
  * module.cft_api_mgmt_api.azurerm_api_management_product_api.link_to_product[0]
  * module.cft_api_mgmt_policy.azurerm_api_management_api_policy.api_policy
  * module.cft_api_mgmt_product.azurerm_api_management_product.product
  * module.cft_api_mgmt_product.azurerm_api_management_product_group.access_control_groups[&#34;developers&#34;]
  * module.fees-register-database-v15.terraform_data.trigger_password_reset
* Replace
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.fee_pay_team_fee_register_subscription will be created
  + resource "azurerm_api_management_subscription" "fee_pay_team_fee_register_subscription" {
      + allow_tracing       = true
      + api_management_name = "cft-api-mgmt-prod"
      + display_name        = "Fee Register API - Fee and Pay DTS Team Subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + product_id          = (known after apply)
      + resource_group_name = "cft-prod-network-rg"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
    }

  # azurerm_api_management_subscription.liberata_supplier_fee_register_subscription will be created
  + resource "azurerm_api_management_subscription" "liberata_supplier_fee_register_subscription" {
      + allow_tracing       = true
      + api_management_name = "cft-api-mgmt-prod"
      + display_name        = "Fee Register API - Liberata Subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + product_id          = (known after apply)
      + resource_group_name = "cft-prod-network-rg"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
    }

  # azurerm_key_vault_secret.fee_pay_team_fee_register_subscription_key will be created
  + resource "azurerm_key_vault_secret" "fee_pay_team_fee_register_subscription_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccpay-prod/providers/Microsoft.KeyVault/vaults/ccpay-prod"
      + name                    = "fee-pay-team-fee-register-cft-apim-subscription-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.liberata_supplier_fee_register_subscription_key will be created
  + resource "azurerm_key_vault_secret" "liberata_supplier_fee_register_subscription_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccpay-prod/providers/Microsoft.KeyVault/vaults/ccpay-prod"
      + name                    = "liberata-cft-apim-fee-register-subscription-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.cft_api_mgmt_api.azurerm_api_management_api.api will be created
  + resource "azurerm_api_management_api" "api" {
      + api_management_name   = "cft-api-mgmt-prod"
      + api_type              = "http"
      + display_name          = "Fee Register API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "feeregister-api"
      + path                  = "feeRegister-api"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "cft-prod-network-rg"
      + revision              = "1"
      + service_url           = "http://fees-register-api-prod.service.core-compute-prod.internal"
      + soap_pass_through     = (known after apply)
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "swagger-link-json"
          + content_value  = "https://raw.githubusercontent.com/hmcts/cnp-api-docs/master/docs/specs/ccpay-payment-app.freg_api1.json"
        }
    }

  # module.cft_api_mgmt_api.azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "cft-api-mgmt-prod"
      + api_name            = "feeregister-api"
      + id                  = (known after apply)
      + product_id          = "feeregister"
      + resource_group_name = "cft-prod-network-rg"
    }

  # module.cft_api_mgmt_policy.azurerm_api_management_api_policy.api_policy will be created
  + resource "azurerm_api_management_api_policy" "api_policy" {
      + api_management_name = "cft-api-mgmt-prod"
      + api_name            = "feeregister-api"
      + id                  = (known after apply)
      + resource_group_name = "cft-prod-network-rg"
      + xml_content         = <<-EOT
            <policies>
              <backend>
                <base/>
              </backend>
              <inbound>
                <base/>
                <choose>
                  <when condition="@(context.Request.Headers["X-ARR-ClientCertThumbprint"] == null)">
                  <return-response>
                    <set-status code="401" />
                    <set-body>Missing client certificate</set-body>
                  </return-response>
                </when>
                <when condition="@(!(new string[] {&quot;B9D9E70AC23EAF8EA094F6B59EF77FF77D977CBE&quot;,&quot;68EDF481C5394D65962E9810913455D3EC635FA5&quot;,&quot;B1BF8007527F85085D7C4A3DC406A9A6D124D721&quot;,&quot;B49BDDE7818B78058AC7401BE0284A40845031E3&quot;,&quot;C6E2FBAB5FED58FD86C10A3BD212CF44668FD1A3&quot;,&quot;7744A2F56BD3B73C0D7FED61309E1C65AF08538C&quot;}.Any(c => context.Request.Headers.ContainsKey(&quot;X-ARR-ClientCertThumbprint&quot;) && context.Request.Headers[&quot;X-ARR-ClientCertThumbprint&quot;].Contains(c))))">
                  <return-response>
                    <set-status code="401" />
                    <set-body>Invalid client certificate</set-body>
                  </return-response>
                </when>
                <when condition="@(context.Request.Certificate == null || context.Request.Certificate.NotAfter < DateTime.Now || context.Request.Certificate.NotBefore > DateTime.Now || !(new string[] {&quot;B9D9E70AC23EAF8EA094F6B59EF77FF77D977CBE&quot;,&quot;68EDF481C5394D65962E9810913455D3EC635FA5&quot;,&quot;B1BF8007527F85085D7C4A3DC406A9A6D124D721&quot;,&quot;B49BDDE7818B78058AC7401BE0284A40845031E3&quot;,&quot;C6E2FBAB5FED58FD86C10A3BD212CF44668FD1A3&quot;,&quot;7744A2F56BD3B73C0D7FED61309E1C65AF08538C&quot;}.Any(c => c == context.Request.Certificate.Thumbprint)))" >
                  <return-response>
                    <set-status code="401" reason="Invalid client certificate. Please check expiry."/>
                  </return-response>
                </when>
              </choose>
              </inbound>
              <outbound>
                <base/>
            </outbound>
              <on-error>
                <base/>
              </on-error>
            </policies>
        EOT
    }

  # module.cft_api_mgmt_product.azurerm_api_management_product.product will be created
  + resource "azurerm_api_management_product" "product" {
      + api_management_name   = "cft-api-mgmt-prod"
      + approval_required     = true
      + display_name          = "feeregister"
      + id                    = (known after apply)
      + product_id            = "feeregister"
      + published             = true
      + resource_group_name   = "cft-prod-network-rg"
      + subscription_required = true
      + subscriptions_limit   = 20
    }

  # module.cft_api_mgmt_product.azurerm_api_management_product_group.access_control_groups["developers"] will be created
  + resource "azurerm_api_management_product_group" "access_control_groups" {
      + api_management_name = "cft-api-mgmt-prod"
      + group_name          = "developers"
      + id                  = (known after apply)
      + product_id          = "feeregister"
      + resource_group_name = "cft-prod-network-rg"
    }

  # module.fees-register-database-v15.terraform_data.trigger_password_reset will be created
  + resource "terraform_data" "trigger_password_reset" {
      + id     = (known after apply)
      + input  = ""
      + output = (known after apply)
    }

  # module.sdp_db_user[0].data.azurerm_key_vault.sdp_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "sdp_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "mi-vault-prod"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "mi-prod-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.sdp_db_user[0].data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_name" {
      ~ id                      = "https://mi-vault-prod.vault.azure.net/secrets/fees-register-postgres-db-v15-prod-read-user-name/f76e563ef3d04efeac0a9521661eb7af" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod" # forces replacement -> (known after apply) # forces replacement
        name                    = "fees-register-postgres-db-v15-prod-read-user-name"
      ~ resource_id             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/fees-register-postgres-db-v15-prod-read-user-name/versions/f76e563ef3d04efeac0a9521661eb7af" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/fees-register-postgres-db-v15-prod-read-user-name" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "f76e563ef3d04efeac0a9521661eb7af" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-prod.vault.azure.net/secrets/fees-register-postgres-db-v15-prod-read-user-name" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_password" {
      ~ id                      = "https://mi-vault-prod.vault.azure.net/secrets/fees-register-postgres-db-v15-prod-read-user-password/18e3c9ebe0904300b42c68d04f4eda4c" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod" # forces replacement -> (known after apply) # forces replacement
        name                    = "fees-register-postgres-db-v15-prod-read-user-password"
      ~ resource_id             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/fees-register-postgres-db-v15-prod-read-user-password/versions/18e3c9ebe0904300b42c68d04f4eda4c" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.KeyVault/vaults/mi-vault-prod/secrets/fees-register-postgres-db-v15-prod-read-user-password" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "18e3c9ebe0904300b42c68d04f4eda4c" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-prod.vault.azure.net/secrets/fees-register-postgres-db-v15-prod-read-user-password" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 12 to add, 0 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":589,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->